enq.org
#+setupfile: ./org/info/index-bigblow-header.setup
#+include: ./org/info/common-header.org
#+AUTHOR: 鈴木正幸，非常勤講師
#+Title: 生物統計学 アンケート
#+OPTIONS: tex:t 
#+property: header-args:R :session *biot* :results output :exports both

* 01/13 12回目
** 理解したこと、印象に残ったこと
- Rでt検定を行う方法について学んだ。群間変動の考え方を学んだ。
- Rstudioでの検定の方法
- PDF化
- 変動を二つ考える理由が理解できた
- "csvファイルの読み込みの際に文字化けしましたが、直して取り込めたのでよかったです。
- 計算も映しながら書いて下さったので見やすく、理解しやすかったです。"
- t-検定、Welchの検定

** 理解できなかったこと
- Rでbookにすることができなかった。htmlなら出力できるがpdfにするとエラーが出てしまう。LateXの問題なのだろうか。
- tinytexがインストールできない
- PDFにする方法
- 一元配置分散分析

** 質問・要望・意見をお願いします．

- 補講があるのを忘れていました。遅れてしまい申し訳ありませんでした。

- いつもよりわかりやすかったかもしれないです

- オンラインだとスライドやRstudioなどが見やすく、わかりやすかったです。

* 01/06 11回目

** 理解したこと、印象に残ったこと
- 検出力、危険率など初めて聞く言葉の意味を学べた。
- 検定力について

  
** 理解できなかったこと

- 危険率、信頼率、第二種の過誤を犯す確率、検出力の関係が理解が足りなかっ
  た。グラフを見ればなんとなく分かる気もするが、実際に数式で考えてみる
  と混乱してしまいました。

** 質問・要望・意見をお願いします．

- 特にないです

* 12/23 10回目

** 理解したこと、印象に残ったこと

- 母集団の分散が不明な時、不偏分散を使うことで求められなかったものを求められるようになること。
- 検定について学んだ。Rでt検定を行う方法と、その結果の読み方が分かった。
- t検定など
- Rだと簡単に検定等ができ、統計をやるのにRが適しているわけが分かってきました。

  
** 理解できなかったこと

- 検定のところに入ってから、統計の勉強で自分の理解できていないところが
  わかってきたので復習しておきたいです。

  
** 質問・要望・意見をお願いします．

- まとめHPに上がっているRmdのファイルが文字化けしていたり、ファイルが
  ないと表示されたりしたので見れるようにしていただきたいです。
- テストは筆記よりレポート形式がいいと思います


* 12/16 9回目

** 理解したこと、印象に残ったこと
- Rstudioの使い方
- 対立仮説などについて理解することができた
- 検定について勉強した。特に帰無仮説の設定の仕方が印象に残った。証明し
  たいことの反対の内容で仮説を立てることで、それと異なっている、つまり
  対立仮説が採用されるというのが納得できた。
- 前回分からなかった部分が理解できたのでよかったです。
- 対立仮説について

** 理解できなかったこと
- 大豆のデータのリンクをクリックしてもRstudioの方に反映されずにエラーが起きた。

- 今日の授業の本題ではないのですが2回目のレポートの2-2 (n-1)*標本不
  偏分散/母分散 が従う分布がどうすればいいのかよく分からなかったです。
  どのようなグラフを作成し、なにを読み取れば良いのでしょうか。

  - (:-s) [[./org/R-text-3.org]] で説明します。
    ./org/example-03.Rmd,

  - 標本不偏分散がどんな分布になるのかを理解すればいいです。

- 未だに例代からRで計算するのがスムーズにできないので数式の理解とRのコー
  ドとの関連付けをしたいです。

  - 今迄紹介してきたコードについて，ざっと振り返ってみまようか。

    [[./org/R-text/code]]

** 質問・要望・意見をお願いします．

- 先生の手書きでの復習・解説が分かりやすかったので今後も続けてもらいた
  いです。

- 手書き解説が良かった

* 12/09 8回目

** 理解したこと、印象に残ったこと

- ファイルの読み込みで、Rでtextファイルを作ることができるのを知らなかっ
  たので勉強になりました。

  しかし、read.tableは列１行５のファイルができ
  てしまいうまくいきませんでした。

- 二項分布の概要

- 信頼区間など

- 危険度・信頼度と信頼区間
  
** 理解できなかったこと

- 母分散わからない時に標本普遍分散を用いる意味が教科書を読んでも、先生
  の説明を聞いていてもよく分かりませんでした。

  (:-s) 標本不偏分散は，標本サイズがおおきくなれば，母分散に一致 (確率収束)
  するから，母分散の代りにします。

- 母平均の区間推定で（分散未知）、下側97.5%, 上側2.5% 点にする意味がよ
  くわかりませんでした。

  (:-s) 97.5-2.5 = 95 で，95%の信頼区間になります。

- 母平均の区間推定を求めるためのコード

  (:-s) もう一度説明します。

** 質問・要望・意見をお願いします．

- 理解が追いついていないだけだと思うのですが、私にとっては少し説明が早
  口でどんどんいってしまうときがあるので、公式の説明などの時はもう少し
  ゆっくり説明していただきたいです。

  (:-s) 気をつけます。その時，注意してもらうのが一番いいです。

- 自分はRconsoleを使用しているのですが、先生が使ってらっしゃるのは
  Rcomanderの方でしょうか。

  (:-s) 最近は，Rstudio を推奨しています。僕が使っているのは，emacs
  org-mode というのです。

- 授業で取り扱ったRの演習の通りにコマンドを作成しているつもりなのです
  がどうしてもエラーが吐かれてしまい、課題がなかなか進みません。もう少
  し頑張ってみます。

  (:-s) 講義終了後 時間があるので，是非相談してください。

- 全体的に難しかった。

  (:-s) 一度，推定の復習をしましょうか。


* 12/02 7回目

** 理解したこと、印象に残ったこと

- 標準正規分布の概要

- 前回実習と被り授業に参加できませんでしたが、webに詳しくまとめてくださっ
  ていたので置いていかれずに済みました。課題をやることで理解できているか
  確認したいと思います。

** 理解できなかったこと

- 信頼区間がある程度確からしいという理由で95%なのは分かったのですが、
  その95という数字自体はどこから出てきたのかがいまいちつかめませんでし
  た。慣例のようなものでしょうか。

  - ((s-:)) 標準誤差の2倍程度
  
- ファイルからの読み込み方、ファイルへの書きだし、プログラムの読み込み
  方。

- 数値をRスタジオに表示させる方法

  - ((s-:)) ? 数値の入ったファイルを作る方法のこと？ テキストエディタ・
    アプリを使う。メモ帖とか。

- 8.ファイルからの読み込みで、まず自分でデータファイルを作れませんでし
  た。パスの指定等の方法はわかるのですが、自分で数字の入ったデータファ
  イルを作るのかが分からず止まってしまいました。

  - ((s-:)) もう一度やってみましょう。

- PDFへの変換方法

  

** 質問・要望・意見をお願いします．

- 中心極限定理の説明がよくわかりませんでした。二項分布でもサンプルサイ
  ズが大きくなると正規分布に近づくとグラフにすると分かるのですが、理屈
  では納得できていないので解説をお願いします。

  - ベルヌーイ試行が基本，一様分布はその多変数版
  - ベルヌーイ試行の和の分布が，二項分布， 多変数版が多項分布
  - 二項分布は，イメージできて，正確に確率計算 (整数計算) ができる

  - 二項分布

  http://www.chem.konan-u.ac.jp/applphys/web_material/GaussFromBinominal.pdf
  


- ウェブクラスで12/2の出席確認をするのが遅れてしまい、遅刻になっていま
  すが授業には頭から参加していましたので、成績つける際には考慮していた
  だきたいです。

- WEBに授業の内容がまとまっていて、その日にどんなことを取り組むか、取
  り組んだかが分かるので今後も更新して頂きたいです。


* 11/25 6回目

** 理解したこと、印象に残ったこと
- Rでのヒストグラムの書き方
- 表の作成のコマンドを学べました
- ガラフの書き方
- 正規分布のグラフの書き方
- Rの少し発展的な操作
- グラフの書き方が分かった

** 理解できなかったこと
- 手動で入力するとほとんどエラーになってしまう
- 標本分布を求めるコードの書き方とその原理


** 質問・要望・意見をお願いします．
- 先生のスクリプト中に良く入っている、コードの改行のやり方（for文書く
  時などの実行せずに改行する方法）が分かりません。

- 授業スピードがすこし速いとおもった









* 11/11 5回目


** 理解したこと、印象に残ったこと

- 確率分布
- 今までよりも発展的な知識を学んだ
- 前半にやった実習ではif、whileは自分でもやることができて例題も解けて楽しかった
- else文を打つ際にそのまま改行してしまうと文法ミスと判断されると初めて
  知った。}elseと表記するのはその対策だと知り、今後間違えないように気
  を付けようと思った。
- 初歩的な関数の書き方
- ・while構文の際に13−2の課題で、式を間違えると出力された値が延々にコ
  ンソールに出力されたので、ループが起こっている事を身をもって知ること
  ができました。
- ・for文やwhile文の構造を板書してくださったことで中で何が起こっている
  のかイメージしやすかったです。
- if,whlil,for構文
- 標本について
- 講義の趣旨とはずれますがグラフのplotの際に色を変える方法について理解できました。
- 繰り返し処理のwhile,for文
- 基本的なRの構文について理解して使うことが出来た

** 理解できなかったこと

- 全体的に少し早くて所々分からなかった
- whileが難しかった
- forの方はコマンド入力をしても所謂回答のような青文字が出てこなくて何
  が間違っているのか分からなかった。コマンドを打った後に何か代入の式を
  もう一つ入力しなければならないのだろうか？
- if文でｌist()を使う理由が分からなかった。
- ポアソン分布の概要
- ・課題13−2ができていないので家でやり直したいと思います。
- ・dice2[i+j] <- dice2[i+j] + dice[i]*dice[j]のプログラムがいまいち理
  解できませんでした。
- Whileの使い方がいまいちよく分かりませんでした。
- Rのif文　課題13－1、関数ｄの定義

** 質問・要望・意見をお願いします．

- 期末テストなどはありますか。

- もう少しゆっくりにしてほしい

- 最近少しずつRの入力ができるようになってきて楽しい。最終的な試験では
  どのように扱うのかが気になった。

- 授業用のページ（先生の演習ノート）があるため多少躓いても授業に戻れた
  ので、今後も続けてもらえたら嬉しいです。

- ・forとwhileの構文の違いは、for文は繰り返しの回数が決まっている場合
  に使い、while文は繰り返しの回数が決まっていない場合で条件を満たして
  いる限り処理を繰り返したい時に使うということで良いのでしょうか。

- Rの練習問題の解答を出してほしいです。

* 11/04 4回目


** 理解したこと、印象に残ったこと

- プロットの仕方、二項分布の意味

- Rの使い方

- 特にありません。

- Rにおいて関数記号を覚えることが重要であること、

- 予習してあやふやだった部分を授業の説明で補足できたので、確率変数と確
  率分布について理解できました。統計をRのコードではどのように打つのか
  を学ぶことができたので、もっとRでどのように統計を行うのか勉強してい
  きたいです。

- 連続型の数値の確率密度は積分によって得られると知った。連続型確率変数
  の場合、確率変数がある一点の値をとる確率は0になるため確率密度を用い
  るという。その際、連続型確率変数Xがある値xをとる確率密度を関数にした
  ものを確率密度関数と呼び、Rではdunif()を用いて求められると知り、複雑
  な計算がコマンド一つでできるのは便利だと思った。
- 確率分布






































































































  

** 理解できなかったこと

- Rに確率の計算させる方法(プログラムの組み方)

- Rのコードとグラフを同時に提出する方法

- 計算を関数に置き換える作業は難しかった

- やはり分散の説明が腑に落ちなかったです。

- 繰り返し処理のプログラムの書き方と意味がよく分からなかった







































































































** 質問・要望・意見をお願いします．

- どこのファイルやページを開いて説明しているのか分からないことが時々あり
  ます。できれば、その都度言っていただけると嬉しいです。

- 統計の説明とプログラミングで半々で授業を進めていくこのままの形式で良いと思います。
  分かりやすいです。

- 今の授業スタイル（Rの時間と統計学の時間を分ける）で続けてほしいと思っ
  た。Rの時間に関してはもう少しスピードが速くても良いようにも思う。

- プログラミングができるようになるには？







































































































* 10/28 3回目
** 理解したこと、印象に残ったこと
- 四則演算について
- Rの使い方
- 行列を考える際や、データの個数や平均、標準偏差や標準分散などが素早く正確に知ることができて便利だと感じました。
- 前回に続いて統計の基礎を学んだ
- Rの行列の使い方を学んだ
- 先に入門統計学を読んでから授業に参加したので分散、標準偏差等理解しやすかったです。
- data.frameとlistの違いについて理解できた。
- 今日の講義では複数のデータをグラフ化した。データを一見しただけでは分からない特徴が形となって現れるため、モデル構築する際の参考になると思った。
- Ｒを使うことで、表のデータを解析したり、グラフにまとめられることがわかった。
- 簡単な行列の作成と演算、箱ひげ図のプロットの仕方
- 行列
- グラフなどもRでできてしまうこと

** 理解できなかったこと
- 最後のスライドについて
- 統計学の最終的な使い方わからない
- 物理を今まで取っていなかったので、分散の例えの説明がよく理解できませんでした。
- 関数や言葉の意味が分からないまま進むことがあったので、少し難しく感じ
  た。どの関数がどういうことができるのか、というのは覚えなければ使いこ
  なせないため早く覚えなければと思った。
- ヒストグラムが開けなかったので、RStudioでないとだめなのかわからなかっ
  た。
- array（ベクトル、各次元の要素の個数）が何を意味するのかよく分からな
  かった
- 先生がどのスライドをひらいているかたまにわからない
- Excel等のデータ情報をRで読み取ること

** 質問・要望・意見をお願いします．
   
- 授業の進行速度はちょうど良い。タイピングに自信がないが集中して取り組
  めばついて行けるので、このままで大丈夫だと思う。
- 出席しました
- Ｒの使い方や統計学の基礎知識などを説明してただいていますが、いまいち
  生物統計学がどのようなものなのかまだ理解できていない気がします。
- 物理の例えはわかり辛かったので他の例えをお願いします。
- 今後実施する予定でしたら申し訳ないのですが、Rのプログラムによる図表
  のプロットにも今後の講義で触れて欲しいです。
- 用語の説明が欲しいと思った。確率密度関数の説明があったが、計算式の説
  明の前にその目的や言葉の説明があるととっかかりやすいように感じた。と
  はいえ、その都度調べれば対応可能なので、調べる時間が確保できれば良い
  ようにも思った。
- 講義最後の大豆データに関するもので、Rでダイズデータを読み込むことが
  できなかったので、次回冒頭でもう一度説明していただけるとありがたいで
  す。
- 最初はプログラミング、その後は、統計の授業のように進行を分けても良い
  かもしれません







































































































  
  












































































































































































































* 10/14 2回目

** 理解したこと、印象に残ったこと
   - ここまで関数を丁寧に解説してもらえる授業は他になかったためとても分かりやすかった。
   - 特にwhich関数の使い方が参考になった。which()[]で抽出したデータの中から要素を取り出すことができると知り、便利だと思った。Rの関数は無数にあるため、分かりやすい解説とともに教えてもらえて良かった。
   - Rを使う中であまり細かいところは意識して使ってこなかったので、細かい部分の確認ができて良かったです。
   - 基本的な代入の仕方
   - Rの使い方、Rの便利さ
   - 始めは何も分からず入力していたコマンドで回答が瞬時に帰ってくることが非常に印象に残ったし楽しかった。
   - Rを利用した計算方法や、Rの機能島について理解できた。
   - Rの使い方、演算方法
   - Rの簡単な演算について
   - Rの開き方使い方
   - ベクトルの表現
   - スライドの内容をRに移しながら使い方やRで出来ることを理解することが出来た
   - プログラミングっぽいことに初めて触れたので、関数を入力すると結果が出ることにとても感動した。前期の確率統計学ではこのような内容は学習しなかったので理解が難しい部分が多いが、資料を見たり自宅でRを使ってみたりして理解を進めていきたいと思う。
   - Rを用いた数値やベクトルの処理の仕方の基礎について理解することが出来ました。掲示されている資料を家でも見返して復習したいと思います。
   - Rにおける基本操作（計算など）
   - Rの操作の基本がわかった
   - Rコマンダーをこのように扱ったことがなかったので、はじめ理解するのに時間がかかったが後半に進むにつれてRコマンダーを使えるようになってきたと感じる。
   - 今後生物統計学で何を学ぶか
   - Rを使うことの便利さが分かりました
   - Rの基本的な使い方や簡単な計算のやり方について
   - アールの扱いについて
   - Rを利用した簡単な演算を理解することができた
   - Rの基礎
   - Ｒの初歩的な使い方、例えば四則演算の仕方や入力したデータが表す意味などを学び、その中で記号の意味などをルールを理解して覚えていくのが大切なのだと感じました。
   - ( )  や［］などを使うことで、何を表すかが変わることがわかった。


** 理解できなかったこと
- 板書
- Rでエラーが出るタイミング
- たまに現れるエラーや、使用するコマンドを覚えなければいけないのかという不安がある。
- スライドの資料のこと
- パワポへの書き込みのいいやり方
- 文字においてから、文字を用いて複数の要素を取り出すことができませんでした。自分なりに頑張ってみます。
- まだ、スライドを見ずに自分で考えながらRを使うことやベクトルのちゃんとした理解が追いつくことが出来なかったと感じた
- 今回の授業については特にありません。
- 今の所は特にないです。
- 最後の方の表
- first,second,などと名前を付ける手法があったが、名前を付けられる、というだけで名前をつけなくとも扱いたい数値の順番を打ち込めばいいのではないかと感じました。今後名前を付けることの利点が出てくるのでしょうか？
- パワポに書き込む方法
- （）と［］の使い分けがよく理解できていない
- 今回出ててきたベクトル表示の意味

  
** 質問・要望・意見をお願いします．
- ベイズ統計を勉強したいのですが、今後の授業で触れる機会はあるのでしょうか。
- Rに関してなのですが、基礎的な項目ということもあり、躓く人も少なそう
  なのでもう少し授業のペースが早くてもいいように感じました。
- もう少しペースが速くても大丈夫です。最後の度数のところは、先生のスラ
  イドの矢印が８の度数のところからずれていただけだと思います。
- もう少しだけ板書の字を大きくしてくだされば助かります。
- 期末試験などの詳細が決まり次第連絡をいただけると助かる。また、今はま
  だ簡単な関数も手間取っているが、慣れてきたら実際にどのように使用され
  ているのかという使用例なども見てみたいと思った。
- 使っていくのは楽しかったのでもっと内容を多くやりたい
- 後半のスライドの重要性があまり理解できなかった
- 次回からは今資料のどの部分を話しているのかもう少し明確にしてくださると、授業についていきやすいと思います。
- これ以降も頑張ります
- こまめにみんなの進捗状況を確かめながら進めていけば良いと思う。また、Rの扱う内容にもよるが、Rと統計の内容を半分ずつにしても良いと思う。
- 今回学んだことやこれから説明していただくRの使い方を理解して統計学をより深く知ることができるように準備したいと思いました。
- もう少し進度を早めて欲しい

