enq.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-19 水 19:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>生物統計学 アンケート</title>
<meta name="author" content="suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">生物統計学 アンケート</h1>

<div id="outline-container-org685522e" class="outline-2">
<h2 id="org685522e">01/13 12回目</h2>
<div class="outline-text-2" id="text-org685522e">
</div>
<div id="outline-container-orgd27326b" class="outline-3">
<h3 id="orgd27326b">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-orgd27326b">
<ul class="org-ul">
<li>Rでt検定を行う方法について学んだ。群間変動の考え方を学んだ。</li>
<li>Rstudioでの検定の方法</li>
<li>PDF化</li>
<li>変動を二つ考える理由が理解できた</li>
<li>"csvファイルの読み込みの際に文字化けしましたが、直して取り込めたのでよかったです。</li>
<li>計算も映しながら書いて下さったので見やすく、理解しやすかったです。"</li>
<li>t-検定、Welchの検定</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5d76ce" class="outline-3">
<h3 id="orgd5d76ce">理解できなかったこと</h3>
<div class="outline-text-3" id="text-orgd5d76ce">
<ul class="org-ul">
<li>Rでbookにすることができなかった。htmlなら出力できるがpdfにするとエラーが出てしまう。LateXの問題なのだろうか。</li>
<li>tinytexがインストールできない</li>
<li>PDFにする方法</li>
<li>一元配置分散分析</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb0a158" class="outline-3">
<h3 id="orgeb0a158">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-orgeb0a158">
<ul class="org-ul">
<li>補講があるのを忘れていました。遅れてしまい申し訳ありませんでした。</li>

<li>いつもよりわかりやすかったかもしれないです</li>

<li>オンラインだとスライドやRstudioなどが見やすく、わかりやすかったです。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd94cc1b" class="outline-2">
<h2 id="orgd94cc1b">01/06 11回目</h2>
<div class="outline-text-2" id="text-orgd94cc1b">
</div>
<div id="outline-container-orgb52ac74" class="outline-3">
<h3 id="orgb52ac74">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-orgb52ac74">
<ul class="org-ul">
<li>検出力、危険率など初めて聞く言葉の意味を学べた。</li>
<li>検定力について</li>
</ul>
</div>
</div>


<div id="outline-container-orgbb651b7" class="outline-3">
<h3 id="orgbb651b7">理解できなかったこと</h3>
<div class="outline-text-3" id="text-orgbb651b7">
<ul class="org-ul">
<li>危険率、信頼率、第二種の過誤を犯す確率、検出力の関係が理解が足りなかっ
た。グラフを見ればなんとなく分かる気もするが、実際に数式で考えてみる
と混乱してしまいました。</li>
</ul>
</div>
</div>

<div id="outline-container-org3ba70e9" class="outline-3">
<h3 id="org3ba70e9">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-org3ba70e9">
<ul class="org-ul">
<li>特にないです</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc6ccac2" class="outline-2">
<h2 id="orgc6ccac2">12/23 10回目</h2>
<div class="outline-text-2" id="text-orgc6ccac2">
</div>
<div id="outline-container-org67b9d6d" class="outline-3">
<h3 id="org67b9d6d">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-org67b9d6d">
<ul class="org-ul">
<li>母集団の分散が不明な時、不偏分散を使うことで求められなかったものを求められるようになること。</li>
<li>検定について学んだ。Rでt検定を行う方法と、その結果の読み方が分かった。</li>
<li>t検定など</li>
<li>Rだと簡単に検定等ができ、統計をやるのにRが適しているわけが分かってきました。</li>
</ul>
</div>
</div>


<div id="outline-container-org81a61a3" class="outline-3">
<h3 id="org81a61a3">理解できなかったこと</h3>
<div class="outline-text-3" id="text-org81a61a3">
<ul class="org-ul">
<li>検定のところに入ってから、統計の勉強で自分の理解できていないところが
わかってきたので復習しておきたいです。</li>
</ul>
</div>
</div>


<div id="outline-container-orgab1ce41" class="outline-3">
<h3 id="orgab1ce41">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-orgab1ce41">
<ul class="org-ul">
<li>まとめHPに上がっているRmdのファイルが文字化けしていたり、ファイルが
ないと表示されたりしたので見れるようにしていただきたいです。</li>
<li>テストは筆記よりレポート形式がいいと思います</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org09c02d9" class="outline-2">
<h2 id="org09c02d9">12/16 9回目</h2>
<div class="outline-text-2" id="text-org09c02d9">
</div>
<div id="outline-container-org8fb0ec3" class="outline-3">
<h3 id="org8fb0ec3">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-org8fb0ec3">
<ul class="org-ul">
<li>Rstudioの使い方</li>
<li>対立仮説などについて理解することができた</li>
<li>検定について勉強した。特に帰無仮説の設定の仕方が印象に残った。証明し
たいことの反対の内容で仮説を立てることで、それと異なっている、つまり
対立仮説が採用されるというのが納得できた。</li>
<li>前回分からなかった部分が理解できたのでよかったです。</li>
<li>対立仮説について</li>
</ul>
</div>
</div>

<div id="outline-container-org5c6bb3d" class="outline-3">
<h3 id="org5c6bb3d">理解できなかったこと</h3>
<div class="outline-text-3" id="text-org5c6bb3d">
<ul class="org-ul">
<li>大豆のデータのリンクをクリックしてもRstudioの方に反映されずにエラーが起きた。</li>

<li>今日の授業の本題ではないのですが2回目のレポートの2-2 (n-1)*標本不
偏分散/母分散 が従う分布がどうすればいいのかよく分からなかったです。
どのようなグラフを作成し、なにを読み取れば良いのでしょうか。

<ul class="org-ul">
<li>(:-s) <a href="./org/R-text-3.html">./org/R-text-3.html</a> で説明します。
./org/example-03.Rmd,</li>

<li>標本不偏分散がどんな分布になるのかを理解すればいいです。</li>
</ul></li>

<li>未だに例代からRで計算するのがスムーズにできないので数式の理解とRのコー
ドとの関連付けをしたいです。

<ul class="org-ul">
<li><p>
今迄紹介してきたコードについて，ざっと振り返ってみまようか。
</p>

<p>
<a href="./org/R-text/code">./org/R-text/code</a>
</p></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org00038ad" class="outline-3">
<h3 id="org00038ad">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-org00038ad">
<ul class="org-ul">
<li>先生の手書きでの復習・解説が分かりやすかったので今後も続けてもらいた
いです。</li>

<li>手書き解説が良かった</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3bee2f6" class="outline-2">
<h2 id="org3bee2f6">12/09 8回目</h2>
<div class="outline-text-2" id="text-org3bee2f6">
</div>
<div id="outline-container-orgaf8b686" class="outline-3">
<h3 id="orgaf8b686">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-orgaf8b686">
<ul class="org-ul">
<li><p>
ファイルの読み込みで、Rでtextファイルを作ることができるのを知らなかっ
たので勉強になりました。
</p>

<p>
しかし、read.tableは列１行５のファイルができ
てしまいうまくいきませんでした。
</p></li>

<li>二項分布の概要</li>

<li>信頼区間など</li>

<li>危険度・信頼度と信頼区間</li>
</ul>
</div>
</div>

<div id="outline-container-org5d207f4" class="outline-3">
<h3 id="org5d207f4">理解できなかったこと</h3>
<div class="outline-text-3" id="text-org5d207f4">
<ul class="org-ul">
<li><p>
母分散わからない時に標本普遍分散を用いる意味が教科書を読んでも、先生
の説明を聞いていてもよく分かりませんでした。
</p>

<p>
(:-s) 標本不偏分散は，標本サイズがおおきくなれば，母分散に一致 (確率収束)
するから，母分散の代りにします。
</p></li>

<li><p>
母平均の区間推定で（分散未知）、下側97.5%, 上側2.5% 点にする意味がよ
くわかりませんでした。
</p>

<p>
(:-s) 97.5-2.5 = 95 で，95%の信頼区間になります。
</p></li>

<li><p>
母平均の区間推定を求めるためのコード
</p>

<p>
(:-s) もう一度説明します。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orga3a3223" class="outline-3">
<h3 id="orga3a3223">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-orga3a3223">
<ul class="org-ul">
<li><p>
理解が追いついていないだけだと思うのですが、私にとっては少し説明が早
口でどんどんいってしまうときがあるので、公式の説明などの時はもう少し
ゆっくり説明していただきたいです。
</p>

<p>
(:-s) 気をつけます。その時，注意してもらうのが一番いいです。
</p></li>

<li><p>
自分はRconsoleを使用しているのですが、先生が使ってらっしゃるのは
Rcomanderの方でしょうか。
</p>

<p>
(:-s) 最近は，Rstudio を推奨しています。僕が使っているのは，emacs
org-mode というのです。
</p></li>

<li><p>
授業で取り扱ったRの演習の通りにコマンドを作成しているつもりなのです
がどうしてもエラーが吐かれてしまい、課題がなかなか進みません。もう少
し頑張ってみます。
</p>

<p>
(:-s) 講義終了後 時間があるので，是非相談してください。
</p></li>

<li><p>
全体的に難しかった。
</p>

<p>
(:-s) 一度，推定の復習をしましょうか。
</p></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org02b7096" class="outline-2">
<h2 id="org02b7096">12/02 7回目</h2>
<div class="outline-text-2" id="text-org02b7096">
</div>
<div id="outline-container-org5377685" class="outline-3">
<h3 id="org5377685">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-org5377685">
<ul class="org-ul">
<li>標準正規分布の概要</li>

<li>前回実習と被り授業に参加できませんでしたが、webに詳しくまとめてくださっ
ていたので置いていかれずに済みました。課題をやることで理解できているか
確認したいと思います。</li>
</ul>
</div>
</div>

<div id="outline-container-org68dffca" class="outline-3">
<h3 id="org68dffca">理解できなかったこと</h3>
<div class="outline-text-3" id="text-org68dffca">
<ul class="org-ul">
<li>信頼区間がある程度確からしいという理由で95%なのは分かったのですが、
その95という数字自体はどこから出てきたのかがいまいちつかめませんでし
た。慣例のようなものでしょうか。

<ul class="org-ul">
<li>((s-:)) 標準誤差の2倍程度</li>
</ul></li>

<li>ファイルからの読み込み方、ファイルへの書きだし、プログラムの読み込み
方。</li>

<li>数値をRスタジオに表示させる方法

<ul class="org-ul">
<li>((s-:)) ? 数値の入ったファイルを作る方法のこと？ テキストエディタ・
アプリを使う。メモ帖とか。</li>
</ul></li>

<li>8.ファイルからの読み込みで、まず自分でデータファイルを作れませんでし
た。パスの指定等の方法はわかるのですが、自分で数字の入ったデータファ
イルを作るのかが分からず止まってしまいました。

<ul class="org-ul">
<li>((s-:)) もう一度やってみましょう。</li>
</ul></li>

<li>PDFへの変換方法</li>
</ul>
</div>
</div>



<div id="outline-container-orgbe4613c" class="outline-3">
<h3 id="orgbe4613c">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-orgbe4613c">
<ul class="org-ul">
<li><p>
中心極限定理の説明がよくわかりませんでした。二項分布でもサンプルサイ
ズが大きくなると正規分布に近づくとグラフにすると分かるのですが、理屈
では納得できていないので解説をお願いします。
</p>

<ul class="org-ul">
<li>ベルヌーイ試行が基本，一様分布はその多変数版</li>
<li>ベルヌーイ試行の和の分布が，二項分布， 多変数版が多項分布</li>
<li>二項分布は，イメージできて，正確に確率計算 (整数計算) ができる</li>

<li>二項分布</li>
</ul>

<p>
<a href="http://www.chem.konan-u.ac.jp/applphys/web_material/GaussFromBinominal.pdf">http://www.chem.konan-u.ac.jp/applphys/web_material/GaussFromBinominal.pdf</a>
</p></li>
</ul>



<ul class="org-ul">
<li>ウェブクラスで12/2の出席確認をするのが遅れてしまい、遅刻になっていま
すが授業には頭から参加していましたので、成績つける際には考慮していた
だきたいです。</li>

<li>WEBに授業の内容がまとまっていて、その日にどんなことを取り組むか、取
り組んだかが分かるので今後も更新して頂きたいです。</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org101097d" class="outline-2">
<h2 id="org101097d">11/25 6回目</h2>
<div class="outline-text-2" id="text-org101097d">
</div>
<div id="outline-container-orgfccaa23" class="outline-3">
<h3 id="orgfccaa23">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-orgfccaa23">
<ul class="org-ul">
<li>Rでのヒストグラムの書き方</li>
<li>表の作成のコマンドを学べました</li>
<li>ガラフの書き方</li>
<li>正規分布のグラフの書き方</li>
<li>Rの少し発展的な操作</li>
<li>グラフの書き方が分かった</li>
</ul>
</div>
</div>

<div id="outline-container-orge9fe782" class="outline-3">
<h3 id="orge9fe782">理解できなかったこと</h3>
<div class="outline-text-3" id="text-orge9fe782">
<ul class="org-ul">
<li>手動で入力するとほとんどエラーになってしまう</li>
<li>標本分布を求めるコードの書き方とその原理</li>
</ul>
</div>
</div>


<div id="outline-container-org58e296e" class="outline-3">
<h3 id="org58e296e">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-org58e296e">
<ul class="org-ul">
<li>先生のスクリプト中に良く入っている、コードの改行のやり方（for文書く
時などの実行せずに改行する方法）が分かりません。</li>

<li>授業スピードがすこし速いとおもった</li>
</ul>
</div>
</div>
</div>









<div id="outline-container-org4c5740b" class="outline-2">
<h2 id="org4c5740b">11/11 5回目</h2>
<div class="outline-text-2" id="text-org4c5740b">
</div>
<div id="outline-container-org139cd66" class="outline-3">
<h3 id="org139cd66">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-org139cd66">
<ul class="org-ul">
<li>確率分布</li>
<li>今までよりも発展的な知識を学んだ</li>
<li>前半にやった実習ではif、whileは自分でもやることができて例題も解けて楽しかった</li>
<li>else文を打つ際にそのまま改行してしまうと文法ミスと判断されると初めて
知った。}elseと表記するのはその対策だと知り、今後間違えないように気
を付けようと思った。</li>
<li>初歩的な関数の書き方</li>
<li>・while構文の際に13−2の課題で、式を間違えると出力された値が延々にコ
ンソールに出力されたので、ループが起こっている事を身をもって知ること
ができました。</li>
<li>・for文やwhile文の構造を板書してくださったことで中で何が起こっている
のかイメージしやすかったです。</li>
<li>if,whlil,for構文</li>
<li>標本について</li>
<li>講義の趣旨とはずれますがグラフのplotの際に色を変える方法について理解できました。</li>
<li>繰り返し処理のwhile,for文</li>
<li>基本的なRの構文について理解して使うことが出来た</li>
</ul>
</div>
</div>

<div id="outline-container-org7c61159" class="outline-3">
<h3 id="org7c61159">理解できなかったこと</h3>
<div class="outline-text-3" id="text-org7c61159">
<ul class="org-ul">
<li>全体的に少し早くて所々分からなかった</li>
<li>whileが難しかった</li>
<li>forの方はコマンド入力をしても所謂回答のような青文字が出てこなくて何
が間違っているのか分からなかった。コマンドを打った後に何か代入の式を
もう一つ入力しなければならないのだろうか？</li>
<li>if文でｌist()を使う理由が分からなかった。</li>
<li>ポアソン分布の概要</li>
<li>・課題13−2ができていないので家でやり直したいと思います。</li>
<li>・dice2[i+j] &lt;- dice2[i+j] + dice[i]*dice[j]のプログラムがいまいち理
解できませんでした。</li>
<li>Whileの使い方がいまいちよく分かりませんでした。</li>
<li>Rのif文　課題13－1、関数ｄの定義</li>
</ul>
</div>
</div>

<div id="outline-container-org435549f" class="outline-3">
<h3 id="org435549f">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-org435549f">
<ul class="org-ul">
<li>期末テストなどはありますか。</li>

<li>もう少しゆっくりにしてほしい</li>

<li>最近少しずつRの入力ができるようになってきて楽しい。最終的な試験では
どのように扱うのかが気になった。</li>

<li>授業用のページ（先生の演習ノート）があるため多少躓いても授業に戻れた
ので、今後も続けてもらえたら嬉しいです。</li>

<li>・forとwhileの構文の違いは、for文は繰り返しの回数が決まっている場合
に使い、while文は繰り返しの回数が決まっていない場合で条件を満たして
いる限り処理を繰り返したい時に使うということで良いのでしょうか。</li>

<li>Rの練習問題の解答を出してほしいです。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgedf62bd" class="outline-2">
<h2 id="orgedf62bd">11/04 4回目</h2>
<div class="outline-text-2" id="text-orgedf62bd">
</div>
<div id="outline-container-org415a758" class="outline-3">
<h3 id="org415a758">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-org415a758">
<ul class="org-ul">
<li>プロットの仕方、二項分布の意味</li>

<li>Rの使い方</li>

<li>特にありません。</li>

<li>Rにおいて関数記号を覚えることが重要であること、</li>

<li>予習してあやふやだった部分を授業の説明で補足できたので、確率変数と確
率分布について理解できました。統計をRのコードではどのように打つのか
を学ぶことができたので、もっとRでどのように統計を行うのか勉強してい
きたいです。</li>

<li>連続型の数値の確率密度は積分によって得られると知った。連続型確率変数
の場合、確率変数がある一点の値をとる確率は0になるため確率密度を用い
るという。その際、連続型確率変数Xがある値xをとる確率密度を関数にした
ものを確率密度関数と呼び、Rではdunif()を用いて求められると知り、複雑
な計算がコマンド一つでできるのは便利だと思った。</li>
<li>確率分布</li>
</ul>
</div>
</div>








































































































<div id="outline-container-orgdfcb0d5" class="outline-3">
<h3 id="orgdfcb0d5">理解できなかったこと</h3>
<div class="outline-text-3" id="text-orgdfcb0d5">
<ul class="org-ul">
<li>Rに確率の計算させる方法(プログラムの組み方)</li>

<li>Rのコードとグラフを同時に提出する方法</li>

<li>計算を関数に置き換える作業は難しかった</li>

<li>やはり分散の説明が腑に落ちなかったです。</li>

<li>繰り返し処理のプログラムの書き方と意味がよく分からなかった</li>
</ul>
</div>
</div>







































































































<div id="outline-container-org3e42440" class="outline-3">
<h3 id="org3e42440">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-org3e42440">
<ul class="org-ul">
<li>どこのファイルやページを開いて説明しているのか分からないことが時々あり
ます。できれば、その都度言っていただけると嬉しいです。</li>

<li>統計の説明とプログラミングで半々で授業を進めていくこのままの形式で良いと思います。
分かりやすいです。</li>

<li>今の授業スタイル（Rの時間と統計学の時間を分ける）で続けてほしいと思っ
た。Rの時間に関してはもう少しスピードが速くても良いようにも思う。</li>

<li>プログラミングができるようになるには？</li>
</ul>
</div>
</div>
</div>







































































































<div id="outline-container-orgc0b1b52" class="outline-2">
<h2 id="orgc0b1b52">10/28 3回目</h2>
<div class="outline-text-2" id="text-orgc0b1b52">
</div>
<div id="outline-container-orgdb74293" class="outline-3">
<h3 id="orgdb74293">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-orgdb74293">
<ul class="org-ul">
<li>四則演算について</li>
<li>Rの使い方</li>
<li>行列を考える際や、データの個数や平均、標準偏差や標準分散などが素早く正確に知ることができて便利だと感じました。</li>
<li>前回に続いて統計の基礎を学んだ</li>
<li>Rの行列の使い方を学んだ</li>
<li>先に入門統計学を読んでから授業に参加したので分散、標準偏差等理解しやすかったです。</li>
<li>data.frameとlistの違いについて理解できた。</li>
<li>今日の講義では複数のデータをグラフ化した。データを一見しただけでは分からない特徴が形となって現れるため、モデル構築する際の参考になると思った。</li>
<li>Ｒを使うことで、表のデータを解析したり、グラフにまとめられることがわかった。</li>
<li>簡単な行列の作成と演算、箱ひげ図のプロットの仕方</li>
<li>行列</li>
<li>グラフなどもRでできてしまうこと</li>
</ul>
</div>
</div>

<div id="outline-container-orgbc93f60" class="outline-3">
<h3 id="orgbc93f60">理解できなかったこと</h3>
<div class="outline-text-3" id="text-orgbc93f60">
<ul class="org-ul">
<li>最後のスライドについて</li>
<li>統計学の最終的な使い方わからない</li>
<li>物理を今まで取っていなかったので、分散の例えの説明がよく理解できませんでした。</li>
<li>関数や言葉の意味が分からないまま進むことがあったので、少し難しく感じ
た。どの関数がどういうことができるのか、というのは覚えなければ使いこ
なせないため早く覚えなければと思った。</li>
<li>ヒストグラムが開けなかったので、RStudioでないとだめなのかわからなかっ
た。</li>
<li>array（ベクトル、各次元の要素の個数）が何を意味するのかよく分からな
かった</li>
<li>先生がどのスライドをひらいているかたまにわからない</li>
<li>Excel等のデータ情報をRで読み取ること</li>
</ul>
</div>
</div>

<div id="outline-container-org26c4474" class="outline-3">
<h3 id="org26c4474">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-org26c4474">
<ul class="org-ul">
<li>授業の進行速度はちょうど良い。タイピングに自信がないが集中して取り組
めばついて行けるので、このままで大丈夫だと思う。</li>
<li>出席しました</li>
<li>Ｒの使い方や統計学の基礎知識などを説明してただいていますが、いまいち
生物統計学がどのようなものなのかまだ理解できていない気がします。</li>
<li>物理の例えはわかり辛かったので他の例えをお願いします。</li>
<li>今後実施する予定でしたら申し訳ないのですが、Rのプログラムによる図表
のプロットにも今後の講義で触れて欲しいです。</li>
<li>用語の説明が欲しいと思った。確率密度関数の説明があったが、計算式の説
明の前にその目的や言葉の説明があるととっかかりやすいように感じた。と
はいえ、その都度調べれば対応可能なので、調べる時間が確保できれば良い
ようにも思った。</li>
<li>講義最後の大豆データに関するもので、Rでダイズデータを読み込むことが
できなかったので、次回冒頭でもう一度説明していただけるとありがたいで
す。</li>
<li>最初はプログラミング、その後は、統計の授業のように進行を分けても良い
かもしれません</li>
</ul>
</div>
</div>
</div>





















































































































































































































































































































<div id="outline-container-org7cae8b8" class="outline-2">
<h2 id="org7cae8b8">10/14 2回目</h2>
<div class="outline-text-2" id="text-org7cae8b8">
</div>
<div id="outline-container-org391bf1e" class="outline-3">
<h3 id="org391bf1e">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-org391bf1e">
<ul class="org-ul">
<li>ここまで関数を丁寧に解説してもらえる授業は他になかったためとても分かりやすかった。</li>
<li>特にwhich関数の使い方が参考になった。which()[]で抽出したデータの中から要素を取り出すことができると知り、便利だと思った。Rの関数は無数にあるため、分かりやすい解説とともに教えてもらえて良かった。</li>
<li>Rを使う中であまり細かいところは意識して使ってこなかったので、細かい部分の確認ができて良かったです。</li>
<li>基本的な代入の仕方</li>
<li>Rの使い方、Rの便利さ</li>
<li>始めは何も分からず入力していたコマンドで回答が瞬時に帰ってくることが非常に印象に残ったし楽しかった。</li>
<li>Rを利用した計算方法や、Rの機能島について理解できた。</li>
<li>Rの使い方、演算方法</li>
<li>Rの簡単な演算について</li>
<li>Rの開き方使い方</li>
<li>ベクトルの表現</li>
<li>スライドの内容をRに移しながら使い方やRで出来ることを理解することが出来た</li>
<li>プログラミングっぽいことに初めて触れたので、関数を入力すると結果が出ることにとても感動した。前期の確率統計学ではこのような内容は学習しなかったので理解が難しい部分が多いが、資料を見たり自宅でRを使ってみたりして理解を進めていきたいと思う。</li>
<li>Rを用いた数値やベクトルの処理の仕方の基礎について理解することが出来ました。掲示されている資料を家でも見返して復習したいと思います。</li>
<li>Rにおける基本操作（計算など）</li>
<li>Rの操作の基本がわかった</li>
<li>Rコマンダーをこのように扱ったことがなかったので、はじめ理解するのに時間がかかったが後半に進むにつれてRコマンダーを使えるようになってきたと感じる。</li>
<li>今後生物統計学で何を学ぶか</li>
<li>Rを使うことの便利さが分かりました</li>
<li>Rの基本的な使い方や簡単な計算のやり方について</li>
<li>アールの扱いについて</li>
<li>Rを利用した簡単な演算を理解することができた</li>
<li>Rの基礎</li>
<li>Ｒの初歩的な使い方、例えば四則演算の仕方や入力したデータが表す意味などを学び、その中で記号の意味などをルールを理解して覚えていくのが大切なのだと感じました。</li>
<li>( )  や［］などを使うことで、何を表すかが変わることがわかった。</li>
</ul>
</div>
</div>


<div id="outline-container-orgded6a2d" class="outline-3">
<h3 id="orgded6a2d">理解できなかったこと</h3>
<div class="outline-text-3" id="text-orgded6a2d">
<ul class="org-ul">
<li>板書</li>
<li>Rでエラーが出るタイミング</li>
<li>たまに現れるエラーや、使用するコマンドを覚えなければいけないのかという不安がある。</li>
<li>スライドの資料のこと</li>
<li>パワポへの書き込みのいいやり方</li>
<li>文字においてから、文字を用いて複数の要素を取り出すことができませんでした。自分なりに頑張ってみます。</li>
<li>まだ、スライドを見ずに自分で考えながらRを使うことやベクトルのちゃんとした理解が追いつくことが出来なかったと感じた</li>
<li>今回の授業については特にありません。</li>
<li>今の所は特にないです。</li>
<li>最後の方の表</li>
<li>first,second,などと名前を付ける手法があったが、名前を付けられる、というだけで名前をつけなくとも扱いたい数値の順番を打ち込めばいいのではないかと感じました。今後名前を付けることの利点が出てくるのでしょうか？</li>
<li>パワポに書き込む方法</li>
<li>（）と［］の使い分けがよく理解できていない</li>
<li>今回出ててきたベクトル表示の意味</li>
</ul>
</div>
</div>


<div id="outline-container-orgf59bd14" class="outline-3">
<h3 id="orgf59bd14">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-orgf59bd14">
<ul class="org-ul">
<li>ベイズ統計を勉強したいのですが、今後の授業で触れる機会はあるのでしょうか。</li>
<li>Rに関してなのですが、基礎的な項目ということもあり、躓く人も少なそう
なのでもう少し授業のペースが早くてもいいように感じました。</li>
<li>もう少しペースが速くても大丈夫です。最後の度数のところは、先生のスラ
イドの矢印が８の度数のところからずれていただけだと思います。</li>
<li>もう少しだけ板書の字を大きくしてくだされば助かります。</li>
<li>期末試験などの詳細が決まり次第連絡をいただけると助かる。また、今はま
だ簡単な関数も手間取っているが、慣れてきたら実際にどのように使用され
ているのかという使用例なども見てみたいと思った。</li>
<li>使っていくのは楽しかったのでもっと内容を多くやりたい</li>
<li>後半のスライドの重要性があまり理解できなかった</li>
<li>次回からは今資料のどの部分を話しているのかもう少し明確にしてくださると、授業についていきやすいと思います。</li>
<li>これ以降も頑張ります</li>
<li>こまめにみんなの進捗状況を確かめながら進めていけば良いと思う。また、Rの扱う内容にもよるが、Rと統計の内容を半分ずつにしても良いと思う。</li>
<li>今回学んだことやこれから説明していただくRの使い方を理解して統計学をより深く知ることができるように準備したいと思いました。</li>
<li>もう少し進度を早めて欲しい</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師</p>
<p class="date">Created: 2022-01-19 水 19:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
